<details>
<summary>Execution result of "run-all plan -lock=false" in "terragrunt/dev"</summary>

```terraform
10:45:24.583 WARN   The `TF_INPUT` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_NON_INTERACTIVE=true` instead.
10:45:29.270 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./github-oidc
- Module ./infra-cd-role
- Module ./infra-ci-role
- Module ./vpc
- Module ./wordpress-blog-tls-cert

Group 2
- Module ./eks
- Module ./rds-subnet-group

Group 3
- Module ./eks-svc
- Module ./wordpress-blog


10:45:31.719 INFO   [infra-cd-role] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-iam.git?depth=1&ref=v5.54.1 into ./infra-cd-role/.terragrunt-cache/39R9Qm_95vYWTPvFJb76UPtFcYI/3EnVVUCmsbqTbM1RfixO5_z_Z2w
10:45:31.730 INFO   [vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git?depth=1&ref=v5.19.0 into ./vpc/.terragrunt-cache/63toT4dm22Ml925jDPh0FKyl75k/A35GeYiqYDYXDWZftKtd1kkU5ic
10:45:31.731 INFO   [github-oidc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-iam.git?depth=1&ref=v5.54.1 into ./github-oidc/.terragrunt-cache/UJdlZDEdS_F6KblU-1rQuaQkkXw/3EnVVUCmsbqTbM1RfixO5_z_Z2w
10:45:31.779 INFO   [wordpress-blog-tls-cert] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-acm.git?depth=1&ref=v6.0.0 into ./wordpress-blog-tls-cert/.terragrunt-cache/uO-XQdI83UQtkOuSi2u220uLyJM/_KSLurNyeATXAamgdT7y7Gc53po
10:45:31.798 INFO   [infra-ci-role] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-iam.git?depth=1&ref=v5.54.1 into ./infra-ci-role/.terragrunt-cache/8hqMuSEaj6Aq2RonGNeUaw63lCo/3EnVVUCmsbqTbM1RfixO5_z_Z2w
10:45:34.259 INFO   [wordpress-blog-tls-cert] terraform: Initializing the backend...
10:45:34.261 INFO   [infra-cd-role] terraform: Initializing the backend...
10:45:34.266 INFO   [infra-ci-role] terraform: Initializing the backend...
10:45:34.268 INFO   [github-oidc] terraform: Initializing the backend...
10:45:34.284 INFO   [vpc] terraform: Initializing the backend...
10:45:35.471 INFO   [wordpress-blog-tls-cert] terraform: 
10:45:35.471 INFO   [wordpress-blog-tls-cert] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:45:35.471 INFO   [wordpress-blog-tls-cert] terraform: use this backend unless the backend configuration changes.
10:45:35.477 INFO   [vpc] terraform: 
10:45:35.477 INFO   [vpc] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:45:35.477 INFO   [vpc] terraform: use this backend unless the backend configuration changes.
10:45:35.501 INFO   [github-oidc] terraform: 
10:45:35.501 INFO   [github-oidc] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:45:35.501 INFO   [github-oidc] terraform: use this backend unless the backend configuration changes.
10:45:35.513 INFO   [infra-ci-role] terraform: 
10:45:35.513 INFO   [infra-ci-role] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:45:35.513 INFO   [infra-ci-role] terraform: use this backend unless the backend configuration changes.
10:45:35.549 INFO   [infra-cd-role] terraform: 
10:45:35.549 INFO   [infra-cd-role] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:45:35.549 INFO   [infra-cd-role] terraform: use this backend unless the backend configuration changes.
10:45:36.352 INFO   [wordpress-blog-tls-cert] terraform: Initializing provider plugins...
10:45:36.352 INFO   [wordpress-blog-tls-cert] terraform: - Finding hashicorp/aws versions matching ">= 6.0.0"...
10:45:36.425 INFO   [github-oidc] terraform: Initializing provider plugins...
10:45:36.425 INFO   [github-oidc] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:45:36.445 INFO   [infra-ci-role] terraform: Initializing provider plugins...
10:45:36.445 INFO   [infra-ci-role] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:45:36.468 INFO   [infra-cd-role] terraform: Initializing provider plugins...
10:45:36.468 INFO   [infra-cd-role] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:45:36.519 INFO   [github-oidc] terraform: - Reusing previous version of hashicorp/tls from the dependency lock file
10:45:36.562 INFO   [vpc] terraform: Initializing provider plugins...
10:45:36.562 INFO   [vpc] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:45:36.585 INFO   [wordpress-blog-tls-cert] terraform: - Installing hashicorp/aws v6.4.0...
10:45:36.603 INFO   [github-oidc] terraform: - Installing hashicorp/aws v5.93.0...
10:45:36.769 INFO   [infra-cd-role] terraform: - Installing hashicorp/aws v5.94.1...
10:45:36.781 INFO   [infra-ci-role] terraform: - Installing hashicorp/aws v5.94.1...
10:45:36.824 INFO   [vpc] terraform: - Installing hashicorp/aws v5.92.0...
10:45:44.849 INFO   [wordpress-blog-tls-cert] terraform: - Installed hashicorp/aws v6.4.0 (signed by HashiCorp)
10:45:44.853 INFO   [wordpress-blog-tls-cert] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
10:45:44.853 INFO   [wordpress-blog-tls-cert] terraform: selections it made above. Include this file in your version control repository
10:45:44.853 INFO   [wordpress-blog-tls-cert] terraform: so that Terraform can guarantee to make the same selections by default when
10:45:44.853 INFO   [wordpress-blog-tls-cert] terraform: you run "terraform init" in the future.
10:45:44.853 INFO   [wordpress-blog-tls-cert] terraform: Terraform has been successfully initialized!
10:45:48.706 INFO   [vpc] terraform: - Installed hashicorp/aws v5.92.0 (signed by HashiCorp)
10:45:48.706 INFO   [vpc] terraform: Terraform has been successfully initialized!
10:45:49.903 INFO   [infra-ci-role] terraform: - Installed hashicorp/aws v5.94.1 (signed by HashiCorp)
10:45:49.904 INFO   [infra-ci-role] terraform: Terraform has been successfully initialized!
10:45:49.940 INFO   [github-oidc] terraform: - Installed hashicorp/aws v5.93.0 (signed by HashiCorp)
10:45:49.973 INFO   [github-oidc] terraform: - Installing hashicorp/tls v4.0.6...
10:45:50.453 INFO   [github-oidc] terraform: - Installed hashicorp/tls v4.0.6 (signed by HashiCorp)
10:45:50.453 INFO   [github-oidc] terraform: Terraform has been successfully initialized!
10:45:50.482 INFO   [infra-cd-role] terraform: - Installed hashicorp/aws v5.94.1 (signed by HashiCorp)
10:45:50.482 INFO   [infra-cd-role] terraform: Terraform has been successfully initialized!
10:45:51.589 STDOUT [wordpress-blog-tls-cert] terraform: aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:eu-west-1:079058212236:certificate/1ba199c9-7297-4d67-b6c0-15855117d6ba]
10:45:52.444 STDOUT [wordpress-blog-tls-cert] terraform: No changes. Your infrastructure matches the configuration.
10:45:52.444 STDOUT [wordpress-blog-tls-cert] terraform: Terraform has compared your real infrastructure against your configuration
10:45:52.444 STDOUT [wordpress-blog-tls-cert] terraform: and found no differences, so no changes are needed.
10:45:54.610 STDOUT [vpc] terraform: aws_vpc.this[0]: Refreshing state... [id=vpc-0f8cc1aab31b4b4e7]
10:45:55.746 STDOUT [github-oidc] terraform: data.tls_certificate.this[0]: Reading...
10:45:55.993 STDOUT [github-oidc] terraform: data.tls_certificate.this[0]: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]
10:45:56.246 STDOUT [infra-ci-role] terraform: data.aws_partition.current: Reading...
10:45:56.246 STDOUT [infra-ci-role] terraform: data.aws_caller_identity.current: Reading...
10:45:56.247 STDOUT [infra-ci-role] terraform: data.aws_partition.current: Read complete after 0s [id=aws]
10:45:56.389 STDOUT [infra-ci-role] terraform: data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:45:56.391 STDOUT [infra-ci-role] terraform: data.aws_iam_policy_document.this[0]: Reading...
10:45:56.396 STDOUT [infra-ci-role] terraform: data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1518182356]
10:45:56.401 STDOUT [infra-ci-role] terraform: aws_iam_role.this[0]: Refreshing state... [id=github-actions-infra-plan20250712203726297300000001]
10:45:56.463 STDOUT [infra-cd-role] terraform: data.aws_caller_identity.current: Reading...
10:45:56.463 STDOUT [infra-cd-role] terraform: data.aws_partition.current: Reading...
10:45:56.465 STDOUT [infra-cd-role] terraform: data.aws_partition.current: Read complete after 0s [id=aws]
10:45:56.469 STDOUT [github-oidc] terraform: data.aws_partition.current: Reading...
10:45:56.470 STDOUT [github-oidc] terraform: data.aws_partition.current: Read complete after 0s [id=aws]
10:45:56.472 STDOUT [github-oidc] terraform: aws_iam_openid_connect_provider.this[0]: Refreshing state... [id=arn:aws:iam::079058212236:oidc-provider/token.actions.githubusercontent.com]
10:45:56.507 STDOUT [vpc] terraform: aws_default_security_group.this[0]: Refreshing state... [id=sg-0d3ec6aaba048175f]
10:45:56.508 STDOUT [vpc] terraform: aws_default_route_table.default[0]: Refreshing state... [id=rtb-049a8b5a2ef6a7e39]
10:45:56.511 STDOUT [vpc] terraform: aws_default_network_acl.this[0]: Refreshing state... [id=acl-06f35801a5bbc9177]
10:45:56.515 STDOUT [vpc] terraform: aws_subnet.database[0]: Refreshing state... [id=subnet-0fdf24361fba20561]
10:45:56.518 STDOUT [vpc] terraform: aws_subnet.private[1]: Refreshing state... [id=subnet-041dcd2af7ed4296f]
10:45:56.520 STDOUT [vpc] terraform: aws_route_table.private[0]: Refreshing state... [id=rtb-0f2f2a582e437df8a]
10:45:56.529 STDOUT [vpc] terraform: aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ef9efd2340ff5c77]
10:45:56.532 STDOUT [vpc] terraform: aws_subnet.public[0]: Refreshing state... [id=subnet-0db263db786cce0c6]
10:45:56.532 STDOUT [vpc] terraform: aws_subnet.database[1]: Refreshing state... [id=subnet-0eef5d6ed9a1ed604]
10:45:56.532 STDOUT [vpc] terraform: aws_route_table.public[0]: Refreshing state... [id=rtb-049e362e83ef6d4d7]
10:45:56.605 STDOUT [infra-cd-role] terraform: data.aws_caller_identity.current: Read complete after 1s [id=079058212236]
10:45:56.607 STDOUT [infra-cd-role] terraform: data.aws_iam_policy_document.this[0]: Reading...
10:45:56.609 STDOUT [infra-cd-role] terraform: data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1518182356]
10:45:56.612 STDOUT [infra-cd-role] terraform: aws_iam_role.this[0]: Refreshing state... [id=github-actions-infra-apply20250712203726282900000001]
10:45:56.702 STDOUT [vpc] terraform: aws_subnet.private[0]: Refreshing state... [id=subnet-0c119c091c410a4aa]
10:45:56.906 STDOUT [vpc] terraform: aws_subnet.public[1]: Refreshing state... [id=subnet-0c18b36e72ae6fb83]
10:45:56.917 STDOUT [infra-ci-role] terraform: aws_iam_role_policy_attachment.this["readonly"]: Refreshing state... [id=github-actions-infra-plan20250712203726297300000001-20250712203727874500000002]
10:45:56.917 STDOUT [infra-ci-role] terraform: aws_iam_role_policy_attachment.this["ssm"]: Refreshing state... [id=github-actions-infra-plan20250712203726297300000001-20250712203728136500000003]
10:45:57.013 STDOUT [github-oidc] terraform: No changes. Your infrastructure matches the configuration.
10:45:57.013 STDOUT [github-oidc] terraform: Terraform has compared your real infrastructure against your configuration
10:45:57.013 STDOUT [github-oidc] terraform: and found no differences, so no changes are needed.
10:45:57.122 STDOUT [infra-cd-role] terraform: aws_iam_role_policy_attachment.this["admin"]: Refreshing state... [id=github-actions-infra-apply20250712203726282900000001-20250712203727945000000002]
10:45:57.173 STDOUT [vpc] terraform: aws_eip.nat[0]: Refreshing state... [id=eipalloc-03bd9370997e2048a]
10:45:57.190 STDOUT [vpc] terraform: aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-049e362e83ef6d4d71080289494]
10:45:57.223 STDOUT [vpc] terraform: aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fea45d8d99bf9795]
10:45:57.224 STDOUT [vpc] terraform: aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d8812285210f8b61]
10:45:57.233 STDOUT [vpc] terraform: aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0fb6904a799d20399]
10:45:57.234 STDOUT [vpc] terraform: aws_db_subnet_group.database[0]: Refreshing state... [id=tempest-dev]
10:45:57.235 STDOUT [vpc] terraform: aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0441b494ba87d19c6]
10:45:57.245 STDOUT [vpc] terraform: aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e49d7b4cc0feaa28]
10:45:57.245 STDOUT [vpc] terraform: aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0148494146972a1eb]
10:45:57.298 STDOUT [infra-ci-role] terraform: No changes. Your infrastructure matches the configuration.
10:45:57.298 STDOUT [infra-ci-role] terraform: 
10:45:57.298 STDOUT [infra-ci-role] terraform: Terraform has compared your real infrastructure against your configuration
10:45:57.298 STDOUT [infra-ci-role] terraform: and found no differences, so no changes are needed.
10:45:57.389 STDOUT [infra-cd-role] terraform: No changes. Your infrastructure matches the configuration.
10:45:57.389 STDOUT [infra-cd-role] terraform: Terraform has compared your real infrastructure against your configuration
10:45:57.389 STDOUT [infra-cd-role] terraform: and found no differences, so no changes are needed.
10:45:57.589 STDOUT [vpc] terraform: aws_nat_gateway.this[0]: Refreshing state... [id=nat-03cf911f608921041]
10:45:57.766 STDOUT [vpc] terraform: aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f2f2a582e437df8a1080289494]
10:45:58.244 STDOUT [vpc] terraform: No changes. Your infrastructure matches the configuration.
10:45:58.245 STDOUT [vpc] terraform: Terraform has compared your real infrastructure against your configuration
10:45:58.245 STDOUT [vpc] terraform: and found no differences, so no changes are needed.
10:46:05.739 INFO   [eks] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-eks.git?depth=1&ref=v20.37.1 into ./eks/.terragrunt-cache/S2TnroGuYY_0Rdg0K0gDuahVmuc/vo8pQqWUeCu_1_TBy7LGvx51SW0
10:46:05.753 INFO   [rds-subnet-group] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-rds.git?depth=1&ref=v6.12.0 into ./rds-subnet-group/.terragrunt-cache/XEuB96Y4dtlWWThMzRUcWrpfWis/z_FacxGUMEuXC2vfXmG-YmYzcss
10:46:06.433 INFO   [eks] terraform: Initializing the backend...
10:46:06.457 INFO   [rds-subnet-group] terraform: Initializing the backend...
10:46:07.607 INFO   [rds-subnet-group] terraform: 
10:46:07.607 INFO   [rds-subnet-group] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:46:07.607 INFO   [rds-subnet-group] terraform: use this backend unless the backend configuration changes.
10:46:07.631 INFO   [eks] terraform: 
10:46:07.631 INFO   [eks] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:46:07.631 INFO   [eks] terraform: use this backend unless the backend configuration changes.
10:46:08.524 INFO   [rds-subnet-group] terraform: Initializing provider plugins...
10:46:08.524 INFO   [rds-subnet-group] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:46:08.645 INFO   [rds-subnet-group] terraform: - Installing hashicorp/aws v5.95.0...
10:46:08.953 INFO   [eks] terraform: Initializing modules...
10:46:08.965 INFO   [eks] terraform: - eks_managed_node_group in modules/eks-managed-node-group
10:46:08.967 INFO   [eks] terraform: - eks_managed_node_group.user_data in modules/_user_data
10:46:08.969 INFO   [eks] terraform: - fargate_profile in modules/fargate-profile
10:46:09.009 INFO   [eks] terraform: Downloading registry.terraform.io/terraform-aws-modules/kms/aws 2.1.0 for kms...
10:46:09.551 INFO   [eks] terraform: - kms in .terraform/modules/kms
10:46:09.563 INFO   [eks] terraform: - self_managed_node_group in modules/self-managed-node-group
10:46:09.564 INFO   [eks] terraform: - self_managed_node_group.user_data in modules/_user_data
10:46:09.570 INFO   [eks] terraform: Initializing provider plugins...
10:46:09.570 INFO   [eks] terraform: - Reusing previous version of hashicorp/time from the dependency lock file
10:46:09.638 INFO   [eks] terraform: - Reusing previous version of hashicorp/cloudinit from the dependency lock file
10:46:09.663 INFO   [eks] terraform: - Reusing previous version of hashicorp/null from the dependency lock file
10:46:09.677 INFO   [eks] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:46:09.696 INFO   [eks] terraform: - Reusing previous version of hashicorp/tls from the dependency lock file
10:46:09.806 INFO   [eks] terraform: - Installing hashicorp/cloudinit v2.3.7...
10:46:10.075 INFO   [eks] terraform: - Installed hashicorp/cloudinit v2.3.7 (signed by HashiCorp)
10:46:10.123 INFO   [eks] terraform: - Installing hashicorp/null v3.2.4...
10:46:10.390 INFO   [eks] terraform: - Installed hashicorp/null v3.2.4 (signed by HashiCorp)
10:46:10.418 INFO   [eks] terraform: - Installing hashicorp/aws v5.100.0...
10:46:15.650 INFO   [rds-subnet-group] terraform: - Installed hashicorp/aws v5.95.0 (signed by HashiCorp)
10:46:15.650 INFO   [rds-subnet-group] terraform: Terraform has been successfully initialized!
10:46:17.303 INFO   [eks] terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
10:46:17.329 INFO   [eks] terraform: - Installing hashicorp/tls v4.1.0...
10:46:17.628 INFO   [eks] terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
10:46:17.654 INFO   [eks] terraform: - Installing hashicorp/time v0.13.1...
10:46:17.923 INFO   [eks] terraform: - Installed hashicorp/time v0.13.1 (signed by HashiCorp)
10:46:17.923 INFO   [eks] terraform: Terraform has been successfully initialized!
10:46:20.373 STDOUT [rds-subnet-group] terraform: aws_db_subnet_group.this[0]: Refreshing state... [id=tempest-dev-20250713194953201300000001]
10:46:21.408 STDOUT [rds-subnet-group] terraform: No changes. Your infrastructure matches the configuration.
10:46:21.408 STDOUT [rds-subnet-group] terraform: Terraform has compared your real infrastructure against your configuration
10:46:21.408 STDOUT [rds-subnet-group] terraform: and found no differences, so no changes are needed.
10:46:23.717 STDOUT [eks] terraform: data.aws_partition.current[0]: Reading...
10:46:23.717 STDOUT [eks] terraform: module.kms.data.aws_partition.current[0]: Reading...
10:46:23.717 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
10:46:23.717 STDOUT [eks] terraform: data.aws_caller_identity.current[0]: Reading...
10:46:23.717 STDOUT [eks] terraform: module.kms.data.aws_caller_identity.current[0]: Reading...
10:46:23.717 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_partition.current: Reading...
10:46:23.718 STDOUT [eks] terraform: data.aws_iam_policy_document.assume_role_policy[0]: Reading...
10:46:23.718 STDOUT [eks] terraform: aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/tempest-dev/cluster]
10:46:23.721 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
10:46:23.721 STDOUT [eks] terraform: aws_security_group.cluster[0]: Refreshing state... [id=sg-0fae217a623b08972]
10:46:23.724 STDOUT [eks] terraform: data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
10:46:23.724 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_partition.current: Read complete after 0s [id=aws]
10:46:23.724 STDOUT [eks] terraform: module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
10:46:23.726 STDOUT [eks] terraform: data.aws_partition.current[0]: Read complete after 0s [id=aws]
10:46:23.733 STDOUT [eks] terraform: aws_iam_role.this[0]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002]
10:46:23.735 STDOUT [eks] terraform: aws_security_group.node[0]: Refreshing state... [id=sg-0e793dda82255aac4]
10:46:23.738 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role.this[0]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001]
10:46:23.738 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_caller_identity.current: Reading...
10:46:23.744 STDOUT [eks] terraform: data.aws_iam_policy_document.custom[0]: Reading...
10:46:23.747 STDOUT [eks] terraform: data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
10:46:23.752 STDOUT [eks] terraform: aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::079058212236:policy/eks/cluster/tempest-dev-cluster-20250720163045635800000001]
10:46:23.861 STDOUT [eks] terraform: module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=079058212236]
10:46:24.003 STDOUT [eks] terraform: data.aws_caller_identity.current[0]: Read complete after 0s [id=079058212236]
10:46:24.004 STDOUT [eks] terraform: data.aws_iam_session_context.current[0]: Reading...
10:46:24.144 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:46:24.167 STDOUT [eks] terraform: data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::079058212236:assumed-role/github-actions-infra-plan20250712203726297300000001/gha-infra-pr]
10:46:24.303 STDOUT [eks] terraform: aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002-20250720163046942300000006]
10:46:24.303 STDOUT [eks] terraform: aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002-20250720163046953000000007]
10:46:24.303 STDOUT [eks] terraform: aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002-20250720163046987700000008]
10:46:24.305 STDOUT [eks] terraform: module.kms.data.aws_iam_policy_document.this[0]: Reading...
10:46:24.307 STDOUT [eks] terraform: module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3977968703]
10:46:24.310 STDOUT [eks] terraform: module.kms.aws_kms_key.this[0]: Refreshing state... [id=7a5088fa-d1c0-4d95-989c-ad58ea02ae02]
10:46:24.350 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001-20250720182432465900000002]
10:46:24.350 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role_policy_attachment.additional["SSM"]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001-20250720182433000200000005]
10:46:24.351 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001-20250720182432750200000003]
10:46:24.403 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001-20250720182432958100000004]
10:46:24.442 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1674922348]
10:46:24.442 STDOUT [eks] terraform: aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-758424649]
10:46:24.442 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2479756397]
10:46:24.442 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-839026525]
10:46:24.445 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3347769987]
10:46:24.448 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2817125511]
10:46:24.458 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2145994836]
10:46:24.487 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-457735071]
10:46:24.515 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1823831157]
10:46:25.064 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2784433123]
10:46:25.084 STDOUT [eks] terraform: aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2100647395]
10:46:25.180 STDOUT [eks] terraform: module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/tempest-dev]
10:46:25.182 STDOUT [eks] terraform: aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::079058212236:policy/tempest-dev-cluster-ClusterEncryption2025072016310867690000000d]
10:46:25.414 STDOUT [eks] terraform: aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002-2025072016310946070000000e]
10:46:25.521 STDOUT [eks] terraform: aws_eks_cluster.this[0]: Refreshing state... [id=tempest-dev]
10:46:26.149 STDOUT [eks] terraform: time_sleep.this[0]: Refreshing state... [id=2025-07-20T16:40:04Z]
10:46:26.149 STDOUT [eks] terraform: aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::079058212236:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/FD0587B907D901DB6631BFB0CFAF90DF]
10:46:26.159 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=2061208417357515898]
10:46:26.165 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_launch_template.this[0]: Refreshing state... [id=lt-0d68edf4cf765334c]
10:46:26.527 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_eks_node_group.this[0]: Refreshing state... [id=tempest-dev:tempest-dev-spot-big-20250720182439562400000008]
10:46:26.802 STDOUT [eks] terraform: aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=tempest-dev:eks-pod-identity-agent]
10:46:26.803 STDOUT [eks] terraform: aws_eks_addon.this["aws-efs-csi-driver"]: Refreshing state... [id=tempest-dev:aws-efs-csi-driver]
10:46:26.803 STDOUT [eks] terraform: aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=tempest-dev:kube-proxy]
10:46:26.803 STDOUT [eks] terraform: aws_eks_addon.this["coredns"]: Refreshing state... [id=tempest-dev:coredns]
10:46:26.804 STDOUT [eks] terraform: aws_eks_addon.this["metrics-server"]: Refreshing state... [id=tempest-dev:metrics-server]
10:46:26.805 STDOUT [eks] terraform: aws_eks_addon.this["eks-node-monitoring-agent"]: Refreshing state... [id=tempest-dev:eks-node-monitoring-agent]
10:46:27.507 STDOUT [eks] terraform: Terraform used the selected providers to generate the following execution
10:46:27.507 STDOUT [eks] terraform: plan. Resource actions are indicated with the following symbols:
10:46:27.507 STDOUT [eks] terraform:   ~ update in-place
10:46:27.507 STDOUT [eks] terraform:  <= read (data resources)
10:46:27.507 STDOUT [eks] terraform: Terraform will perform the following actions:
10:46:27.507 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["aws-efs-csi-driver"] will be read during apply
10:46:27.507 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:46:27.507 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:46:27.507 STDOUT [eks] terraform:       + addon_name         = "aws-efs-csi-driver"
10:46:27.507 STDOUT [eks] terraform:       + id                 = (known after apply)
10:46:27.508 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:46:27.508 STDOUT [eks] terraform:       + most_recent        = true
10:46:27.508 STDOUT [eks] terraform:       + version            = (known after apply)
10:46:27.508 STDOUT [eks] terraform:     }
10:46:27.508 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["coredns"] will be read during apply
10:46:27.508 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:46:27.508 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:46:27.508 STDOUT [eks] terraform:       + addon_name         = "coredns"
10:46:27.508 STDOUT [eks] terraform:       + id                 = (known after apply)
10:46:27.508 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:46:27.508 STDOUT [eks] terraform:       + most_recent        = true
10:46:27.509 STDOUT [eks] terraform:       + version            = (known after apply)
10:46:27.509 STDOUT [eks] terraform:     }
10:46:27.509 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["eks-node-monitoring-agent"] will be read during apply
10:46:27.509 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:46:27.509 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:46:27.509 STDOUT [eks] terraform:       + addon_name         = "eks-node-monitoring-agent"
10:46:27.509 STDOUT [eks] terraform:       + id                 = (known after apply)
10:46:27.509 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:46:27.509 STDOUT [eks] terraform:       + most_recent        = true
10:46:27.509 STDOUT [eks] terraform:       + version            = (known after apply)
10:46:27.509 STDOUT [eks] terraform:     }
10:46:27.509 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["eks-pod-identity-agent"] will be read during apply
10:46:27.509 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:46:27.509 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:46:27.509 STDOUT [eks] terraform:       + addon_name         = "eks-pod-identity-agent"
10:46:27.509 STDOUT [eks] terraform:       + id                 = (known after apply)
10:46:27.509 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:46:27.509 STDOUT [eks] terraform:       + most_recent        = true
10:46:27.509 STDOUT [eks] terraform:       + version            = (known after apply)
10:46:27.509 STDOUT [eks] terraform:     }
10:46:27.509 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
10:46:27.509 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:46:27.510 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:46:27.510 STDOUT [eks] terraform:       + addon_name         = "kube-proxy"
10:46:27.510 STDOUT [eks] terraform:       + id                 = (known after apply)
10:46:27.511 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:46:27.511 STDOUT [eks] terraform:       + most_recent        = true
10:46:27.511 STDOUT [eks] terraform:       + version            = (known after apply)
10:46:27.511 STDOUT [eks] terraform:     }
10:46:27.511 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["metrics-server"] will be read during apply
10:46:27.511 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:46:27.511 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:46:27.511 STDOUT [eks] terraform:       + addon_name         = "metrics-server"
10:46:27.511 STDOUT [eks] terraform:       + id                 = (known after apply)
10:46:27.511 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:46:27.511 STDOUT [eks] terraform:       + most_recent        = true
10:46:27.511 STDOUT [eks] terraform:       + version            = (known after apply)
10:46:27.511 STDOUT [eks] terraform:     }
10:46:27.512 STDOUT [eks] terraform:   # data.tls_certificate.this[0] will be read during apply
10:46:27.512 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:46:27.512 STDOUT [eks] terraform:  <= data "tls_certificate" "this" {
10:46:27.512 STDOUT [eks] terraform:       + certificates = (known after apply)
10:46:27.512 STDOUT [eks] terraform:       + id           = (known after apply)
10:46:27.512 STDOUT [eks] terraform:       + url          = "https://oidc.eks.eu-west-1.amazonaws.com/id/FD0587B907D901DB6631BFB0CFAF90DF"
10:46:27.512 STDOUT [eks] terraform:     }
10:46:27.512 STDOUT [eks] terraform:   # aws_eks_addon.this["aws-efs-csi-driver"] will be updated in-place
10:46:27.513 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:46:27.513 STDOUT [eks] terraform:       ~ addon_version               = "v2.1.9-eksbuild.1" -> (known after apply)
10:46:27.513 STDOUT [eks] terraform:         id                          = "tempest-dev:aws-efs-csi-driver"
10:46:27.513 STDOUT [eks] terraform:         tags                        = {}
10:46:27.513 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:46:27.513 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:46:27.513 STDOUT [eks] terraform:     }
10:46:27.513 STDOUT [eks] terraform:   # aws_eks_addon.this["coredns"] will be updated in-place
10:46:27.513 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:46:27.513 STDOUT [eks] terraform:       ~ addon_version               = "v1.12.2-eksbuild.4" -> (known after apply)
10:46:27.513 STDOUT [eks] terraform:         id                          = "tempest-dev:coredns"
10:46:27.513 STDOUT [eks] terraform:         tags                        = {}
10:46:27.513 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:46:27.513 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:46:27.513 STDOUT [eks] terraform:     }
10:46:27.513 STDOUT [eks] terraform:   # aws_eks_addon.this["eks-node-monitoring-agent"] will be updated in-place
10:46:27.513 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:46:27.513 STDOUT [eks] terraform:       ~ addon_version               = "v1.3.0-eksbuild.2" -> (known after apply)
10:46:27.513 STDOUT [eks] terraform:         id                          = "tempest-dev:eks-node-monitoring-agent"
10:46:27.513 STDOUT [eks] terraform:         tags                        = {}
10:46:27.513 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:46:27.513 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:46:27.513 STDOUT [eks] terraform:     }
10:46:27.513 STDOUT [eks] terraform:   # aws_eks_addon.this["eks-pod-identity-agent"] will be updated in-place
10:46:27.513 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:46:27.514 STDOUT [eks] terraform:       ~ addon_version               = "v1.3.8-eksbuild.2" -> (known after apply)
10:46:27.514 STDOUT [eks] terraform:         id                          = "tempest-dev:eks-pod-identity-agent"
10:46:27.514 STDOUT [eks] terraform:         tags                        = {}
10:46:27.514 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:46:27.514 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:46:27.514 STDOUT [eks] terraform:     }
10:46:27.514 STDOUT [eks] terraform:   # aws_eks_addon.this["kube-proxy"] will be updated in-place
10:46:27.514 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:46:27.514 STDOUT [eks] terraform:       ~ addon_version               = "v1.33.0-eksbuild.2" -> (known after apply)
10:46:27.514 STDOUT [eks] terraform:         id                          = "tempest-dev:kube-proxy"
10:46:27.514 STDOUT [eks] terraform:         tags                        = {}
10:46:27.514 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:46:27.514 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:46:27.514 STDOUT [eks] terraform:     }
10:46:27.514 STDOUT [eks] terraform:   # aws_eks_addon.this["metrics-server"] will be updated in-place
10:46:27.514 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:46:27.514 STDOUT [eks] terraform:       ~ addon_version               = "v0.8.0-eksbuild.1" -> (known after apply)
10:46:27.514 STDOUT [eks] terraform:         id                          = "tempest-dev:metrics-server"
10:46:27.514 STDOUT [eks] terraform:         tags                        = {}
10:46:27.514 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:46:27.514 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:46:27.514 STDOUT [eks] terraform:     }
10:46:27.514 STDOUT [eks] terraform:   # aws_eks_cluster.this[0] will be updated in-place
10:46:27.514 STDOUT [eks] terraform:   ~ resource "aws_eks_cluster" "this" {
10:46:27.514 STDOUT [eks] terraform:         id                            = "tempest-dev"
10:46:27.515 STDOUT [eks] terraform:         name                          = "tempest-dev"
10:46:27.515 STDOUT [eks] terraform:         tags                          = {
10:46:27.515 STDOUT [eks] terraform:             "terraform-aws-modules" = "eks"
10:46:27.515 STDOUT [eks] terraform:         }
10:46:27.515 STDOUT [eks] terraform:         # (12 unchanged attributes hidden)
10:46:27.515 STDOUT [eks] terraform:       ~ vpc_config {
10:46:27.515 STDOUT [eks] terraform:           ~ public_access_cidrs       = [
10:46:27.515 STDOUT [eks] terraform:               - "0.0.0.0/0",
10:46:27.515 STDOUT [eks] terraform:                 # (1 unchanged element hidden)
10:46:27.515 STDOUT [eks] terraform:             ]
10:46:27.515 STDOUT [eks] terraform:             # (6 unchanged attributes hidden)
10:46:27.515 STDOUT [eks] terraform:         }
10:46:27.515 STDOUT [eks] terraform:         # (5 unchanged blocks hidden)
10:46:27.515 STDOUT [eks] terraform:     }
10:46:27.515 STDOUT [eks] terraform:   # aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
10:46:27.515 STDOUT [eks] terraform:   ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
10:46:27.515 STDOUT [eks] terraform:         id              = "arn:aws:iam::079058212236:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/FD0587B907D901DB6631BFB0CFAF90DF"
10:46:27.515 STDOUT [eks] terraform:         tags            = {
10:46:27.515 STDOUT [eks] terraform:             "Name" = "tempest-dev-eks-irsa"
10:46:27.515 STDOUT [eks] terraform:         }
10:46:27.515 STDOUT [eks] terraform:       ~ thumbprint_list = [
10:46:27.515 STDOUT [eks] terraform:           - "06b25927c42a721631c1efd9431e648fa62e1e39",
10:46:27.515 STDOUT [eks] terraform:         ] -> (known after apply)
10:46:27.515 STDOUT [eks] terraform:         # (4 unchanged attributes hidden)
10:46:27.515 STDOUT [eks] terraform:     }
10:46:27.515 STDOUT [eks] terraform:   # module.kms.aws_kms_key.this[0] will be updated in-place
10:46:27.515 STDOUT [eks] terraform:   ~ resource "aws_kms_key" "this" {
10:46:27.515 STDOUT [eks] terraform:         id                                 = "7a5088fa-d1c0-4d95-989c-ad58ea02ae02"
10:46:27.516 STDOUT [eks] terraform:       ~ policy                             = jsonencode(
10:46:27.516 STDOUT [eks] terraform:           ~ {
10:46:27.516 STDOUT [eks] terraform:               ~ Statement = [
10:46:27.516 STDOUT [eks] terraform:                     {
10:46:27.516 STDOUT [eks] terraform:                         Action    = "kms:*"
10:46:27.516 STDOUT [eks] terraform:                         Effect    = "Allow"
10:46:27.516 STDOUT [eks] terraform:                         Principal = {
10:46:27.516 STDOUT [eks] terraform:                             AWS = "arn:aws:iam::079058212236:root"
10:46:27.516 STDOUT [eks] terraform:                         }
10:46:27.516 STDOUT [eks] terraform:                         Resource  = "*"
10:46:27.516 STDOUT [eks] terraform:                         Sid       = "Default"
10:46:27.516 STDOUT [eks] terraform:                     },
10:46:27.516 STDOUT [eks] terraform:                   ~ {
10:46:27.516 STDOUT [eks] terraform:                       ~ Principal = {
10:46:27.516 STDOUT [eks] terraform:                           ~ AWS = "arn:aws:iam::079058212236:user/istram" -> "arn:aws:iam::079058212236:role/github/github-actions-infra-plan20250712203726297300000001"
10:46:27.516 STDOUT [eks] terraform:                         }
10:46:27.516 STDOUT [eks] terraform:                         # (4 unchanged attributes hidden)
10:46:27.516 STDOUT [eks] terraform:                     },
10:46:27.516 STDOUT [eks] terraform:                     {
10:46:27.516 STDOUT [eks] terraform:                         Action    = [
10:46:27.516 STDOUT [eks] terraform:                             "kms:ReEncrypt*",
10:46:27.516 STDOUT [eks] terraform:                             "kms:GenerateDataKey*",
10:46:27.516 STDOUT [eks] terraform:                             "kms:Encrypt",
10:46:27.516 STDOUT [eks] terraform:                             "kms:DescribeKey",
10:46:27.516 STDOUT [eks] terraform:                             "kms:Decrypt",
10:46:27.516 STDOUT [eks] terraform:                         ]
10:46:27.516 STDOUT [eks] terraform:                         Effect    = "Allow"
10:46:27.516 STDOUT [eks] terraform:                         Principal = {
10:46:27.516 STDOUT [eks] terraform:                             AWS = "arn:aws:iam::079058212236:role/eks/cluster/tempest-dev-cluster-20250720163045635900000002"
10:46:27.517 STDOUT [eks] terraform:                         }
10:46:27.517 STDOUT [eks] terraform:                         Resource  = "*"
10:46:27.517 STDOUT [eks] terraform:                         Sid       = "KeyUsage"
10:46:27.517 STDOUT [eks] terraform:                     },
10:46:27.517 STDOUT [eks] terraform:                 ]
10:46:27.517 STDOUT [eks] terraform:                 # (1 unchanged attribute hidden)
10:46:27.517 STDOUT [eks] terraform:             }
10:46:27.517 STDOUT [eks] terraform:         )
10:46:27.517 STDOUT [eks] terraform:         tags                               = {
10:46:27.517 STDOUT [eks] terraform:             "terraform-aws-modules" = "eks"
10:46:27.517 STDOUT [eks] terraform:         }
10:46:27.517 STDOUT [eks] terraform:         # (13 unchanged attributes hidden)
10:46:27.517 STDOUT [eks] terraform:     }
10:46:27.517 STDOUT [eks] terraform: Plan: 0 to add, 9 to change, 0 to destroy.
10:46:27.517 STDOUT [eks] terraform: 
10:46:27.517 STDOUT [eks] terraform: Changes to Outputs:
10:46:27.517 STDOUT [eks] terraform:   ~ cluster_addons                                   = {
10:46:27.517 STDOUT [eks] terraform:       ~ aws-efs-csi-driver        = {
10:46:27.517 STDOUT [eks] terraform:           ~ addon_version               = "v2.1.9-eksbuild.1" -> (known after apply)
10:46:27.517 STDOUT [eks] terraform:             id                          = "tempest-dev:aws-efs-csi-driver"
10:46:27.517 STDOUT [eks] terraform:             tags                        = {}
10:46:27.517 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:46:27.517 STDOUT [eks] terraform:         }
10:46:27.517 STDOUT [eks] terraform:       ~ coredns                   = {
10:46:27.517 STDOUT [eks] terraform:           ~ addon_version               = "v1.12.2-eksbuild.4" -> (known after apply)
10:46:27.517 STDOUT [eks] terraform:             id                          = "tempest-dev:coredns"
10:46:27.517 STDOUT [eks] terraform:             tags                        = {}
10:46:27.517 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:46:27.517 STDOUT [eks] terraform:         }
10:46:27.518 STDOUT [eks] terraform:       ~ eks-node-monitoring-agent = {
10:46:27.518 STDOUT [eks] terraform:           ~ addon_version               = "v1.3.0-eksbuild.2" -> (known after apply)
10:46:27.518 STDOUT [eks] terraform:             id                          = "tempest-dev:eks-node-monitoring-agent"
10:46:27.518 STDOUT [eks] terraform:             tags                        = {}
10:46:27.518 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:46:27.518 STDOUT [eks] terraform:         }
10:46:27.518 STDOUT [eks] terraform:       ~ eks-pod-identity-agent    = {
10:46:27.518 STDOUT [eks] terraform:           ~ addon_version               = "v1.3.8-eksbuild.2" -> (known after apply)
10:46:27.518 STDOUT [eks] terraform:             id                          = "tempest-dev:eks-pod-identity-agent"
10:46:27.518 STDOUT [eks] terraform:             tags                        = {}
10:46:27.518 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:46:27.518 STDOUT [eks] terraform:         }
10:46:27.518 STDOUT [eks] terraform:       ~ kube-proxy                = {
10:46:27.518 STDOUT [eks] terraform:           ~ addon_version               = "v1.33.0-eksbuild.2" -> (known after apply)
10:46:27.518 STDOUT [eks] terraform:             id                          = "tempest-dev:kube-proxy"
10:46:27.518 STDOUT [eks] terraform:             tags                        = {}
10:46:27.518 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:46:27.518 STDOUT [eks] terraform:         }
10:46:27.518 STDOUT [eks] terraform:       ~ metrics-server            = {
10:46:27.518 STDOUT [eks] terraform:           ~ addon_version               = "v0.8.0-eksbuild.1" -> (known after apply)
10:46:27.518 STDOUT [eks] terraform:             id                          = "tempest-dev:metrics-server"
10:46:27.518 STDOUT [eks] terraform:             tags                        = {}
10:46:27.518 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:46:27.519 STDOUT [eks] terraform:         }
10:46:27.519 STDOUT [eks] terraform:     }
10:46:27.519 STDOUT [eks] terraform:   ~ cluster_tls_certificate_sha1_fingerprint         = "06b25927c42a721631c1efd9431e648fa62e1e39" -> (known after apply)
10:46:27.519 STDOUT [eks] terraform:   ~ kms_key_policy                                   = jsonencode(
10:46:27.519 STDOUT [eks] terraform:       ~ {
10:46:27.519 STDOUT [eks] terraform:           ~ Statement = [
10:46:27.519 STDOUT [eks] terraform:                 {
10:46:27.519 STDOUT [eks] terraform:                     Action    = "kms:*"
10:46:27.519 STDOUT [eks] terraform:                     Effect    = "Allow"
10:46:27.519 STDOUT [eks] terraform:                     Principal = {
10:46:27.519 STDOUT [eks] terraform:                         AWS = "arn:aws:iam::079058212236:root"
10:46:27.519 STDOUT [eks] terraform:                     }
10:46:27.519 STDOUT [eks] terraform:                     Resource  = "*"
10:46:27.519 STDOUT [eks] terraform:                     Sid       = "Default"
10:46:27.519 STDOUT [eks] terraform:                 },
10:46:27.519 STDOUT [eks] terraform:               ~ {
10:46:27.519 STDOUT [eks] terraform:                   ~ Principal = {
10:46:27.519 STDOUT [eks] terraform:                       ~ AWS = "arn:aws:iam::079058212236:user/istram" -> "arn:aws:iam::079058212236:role/github/github-actions-infra-plan20250712203726297300000001"
10:46:27.519 STDOUT [eks] terraform:                     }
10:46:27.519 STDOUT [eks] terraform:                     # (4 unchanged attributes hidden)
10:46:27.519 STDOUT [eks] terraform:                 },
10:46:27.519 STDOUT [eks] terraform:                 {
10:46:27.519 STDOUT [eks] terraform:                     Action    = [
10:46:27.519 STDOUT [eks] terraform:                         "kms:ReEncrypt*",
10:46:27.519 STDOUT [eks] terraform:                         "kms:GenerateDataKey*",
10:46:27.519 STDOUT [eks] terraform:                         "kms:Encrypt",
10:46:27.519 STDOUT [eks] terraform:                         "kms:DescribeKey",
10:46:27.519 STDOUT [eks] terraform:                         "kms:Decrypt",
10:46:27.520 STDOUT [eks] terraform:                     ]
10:46:27.520 STDOUT [eks] terraform:                     Effect    = "Allow"
10:46:27.520 STDOUT [eks] terraform:                     Principal = {
10:46:27.520 STDOUT [eks] terraform:                         AWS = "arn:aws:iam::079058212236:role/eks/cluster/tempest-dev-cluster-20250720163045635900000002"
10:46:27.520 STDOUT [eks] terraform:                     }
10:46:27.520 STDOUT [eks] terraform:                     Resource  = "*"
10:46:27.520 STDOUT [eks] terraform:                     Sid       = "KeyUsage"
10:46:27.520 STDOUT [eks] terraform:                 },
10:46:27.520 STDOUT [eks] terraform:             ]
10:46:27.520 STDOUT [eks] terraform:             # (1 unchanged attribute hidden)
10:46:27.520 STDOUT [eks] terraform:         }
10:46:27.520 STDOUT [eks] terraform:     )
10:46:37.101 INFO   [eks-svc] Downloading Terraform configurations from ../../stacks/eks-svc into ./eks-svc/.terragrunt-cache/6Z9yiVJ5Yr-RDY3qcKGmfik7Ly4/qaaRPvfiPI16331-BMfS12cFW_E
10:46:37.125 INFO   [eks-svc] terraform: Initializing the backend...
10:46:38.281 INFO   [eks-svc] terraform: 
10:46:38.281 INFO   [eks-svc] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:46:38.281 INFO   [eks-svc] terraform: use this backend unless the backend configuration changes.
10:46:39.460 INFO   [eks-svc] terraform: Initializing modules...
10:46:39.566 INFO   [eks-svc] terraform: Downloading registry.terraform.io/terraform-aws-modules/efs/aws 1.8.0 for efs...
10:46:39.941 INFO   [wordpress-blog] Downloading Terraform configurations from ../../stacks/wordpress into ./wordpress-blog/.terragrunt-cache/Oq-7VfxVMau8zfRpjyKOgqDak3s/b6RP9HtdDbccBeMcGhySDrWv4aQ
10:46:39.964 INFO   [wordpress-blog] terraform: Initializing the backend...
10:46:40.122 INFO   [eks-svc] terraform: - efs in .terraform/modules/efs
10:46:40.135 INFO   [eks-svc] terraform: Downloading registry.terraform.io/terraform-aws-modules/iam/aws 5.59.0 for role_alb_controller...
10:46:40.845 INFO   [eks-svc] terraform: - role_alb_controller in .terraform/modules/role_alb_controller/modules/iam-role-for-service-accounts-eks
10:46:40.846 INFO   [eks-svc] terraform: Downloading registry.terraform.io/terraform-aws-modules/iam/aws 5.59.0 for role_efs_csi...
10:46:40.874 INFO   [eks-svc] terraform: - role_efs_csi in .terraform/modules/role_efs_csi/modules/iam-role-for-service-accounts-eks
10:46:40.878 INFO   [eks-svc] terraform: Initializing provider plugins...
10:46:40.878 INFO   [eks-svc] terraform: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
10:46:40.903 INFO   [eks-svc] terraform: - Reusing previous version of hashicorp/helm from the dependency lock file
10:46:40.973 INFO   [eks-svc] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:46:41.048 INFO   [eks-svc] terraform: - Installing hashicorp/kubernetes v2.37.1...
10:46:41.252 INFO   [wordpress-blog] terraform: 
10:46:41.252 INFO   [wordpress-blog] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:46:41.252 INFO   [wordpress-blog] terraform: use this backend unless the backend configuration changes.
10:46:41.910 INFO   [eks-svc] terraform: - Installed hashicorp/kubernetes v2.37.1 (signed by HashiCorp)
10:46:41.947 INFO   [eks-svc] terraform: - Installing hashicorp/helm v3.0.2...
10:46:42.328 INFO   [wordpress-blog] terraform: Initializing modules...
10:46:42.349 INFO   [wordpress-blog] terraform: Downloading registry.terraform.io/terraform-aws-modules/rds-aurora/aws 9.15.0 for database...
10:46:42.846 INFO   [eks-svc] terraform: - Installed hashicorp/helm v3.0.2 (signed by HashiCorp)
10:46:42.883 INFO   [eks-svc] terraform: - Installing hashicorp/aws v6.3.0...
10:46:43.151 INFO   [wordpress-blog] terraform: - database in .terraform/modules/database
10:46:43.154 INFO   [wordpress-blog] terraform: Initializing provider plugins...
10:46:43.154 INFO   [wordpress-blog] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
10:46:43.216 INFO   [wordpress-blog] terraform: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
10:46:43.237 INFO   [wordpress-blog] terraform: - Reusing previous version of hashicorp/helm from the dependency lock file
10:46:43.258 INFO   [wordpress-blog] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:46:43.327 INFO   [wordpress-blog] terraform: - Installing hashicorp/random v3.7.2...
10:46:43.543 INFO   [wordpress-blog] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
10:46:43.571 INFO   [wordpress-blog] terraform: - Installing hashicorp/kubernetes v2.37.1...
10:46:44.382 INFO   [wordpress-blog] terraform: - Installed hashicorp/kubernetes v2.37.1 (signed by HashiCorp)
10:46:44.458 INFO   [wordpress-blog] terraform: - Installing hashicorp/helm v3.0.2...
10:46:45.396 INFO   [wordpress-blog] terraform: - Installed hashicorp/helm v3.0.2 (signed by HashiCorp)
10:46:45.478 INFO   [wordpress-blog] terraform: - Installing hashicorp/aws v6.3.0...
10:46:50.249 INFO   [eks-svc] terraform: - Installed hashicorp/aws v6.3.0 (signed by HashiCorp)
10:46:50.249 INFO   [eks-svc] terraform: Terraform has been successfully initialized!
10:46:52.699 INFO   [wordpress-blog] terraform: - Installed hashicorp/aws v6.3.0 (signed by HashiCorp)
10:46:52.699 INFO   [wordpress-blog] terraform: Terraform has made some changes to the provider dependency selections recorded
10:46:52.699 INFO   [wordpress-blog] terraform: in the .terraform.lock.hcl file. Review those changes and commit them to your
10:46:52.699 INFO   [wordpress-blog] terraform: version control system if they represent changes you intended to make.
10:46:52.699 INFO   [wordpress-blog] terraform: Terraform has been successfully initialized!
10:46:55.934 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_caller_identity.current: Reading...
10:46:55.934 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_region.current: Reading...
10:46:55.934 STDOUT [eks-svc] terraform: data.aws_eks_cluster.this: Reading...
10:46:55.934 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_partition.current: Reading...
10:46:55.934 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_iam_policy_document.efs_csi[0]: Reading...
10:46:55.935 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_region.current: Reading...
10:46:55.935 STDOUT [eks-svc] terraform: data.aws_eks_cluster_auth.this: Reading...
10:46:55.935 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_partition.current: Reading...
10:46:55.935 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_caller_identity.current: Reading...
10:46:55.937 STDOUT [eks-svc] terraform: module.efs.aws_efs_file_system.this[0]: Refreshing state... [id=fs-0658cd6d467b1a715]
10:46:55.941 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_region.current: Read complete after 0s [id=eu-west-1]
10:46:55.941 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_partition.current: Read complete after 0s [id=aws]
10:46:55.941 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_partition.current: Read complete after 0s [id=aws]
10:46:55.941 STDOUT [eks-svc] terraform: data.aws_eks_cluster_auth.this: Read complete after 0s [id=tempest-dev]
10:46:55.941 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_region.current: Read complete after 0s [id=eu-west-1]
10:46:55.941 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_iam_policy_document.efs_csi[0]: Read complete after 0s [id=3064053908]
10:46:55.945 STDOUT [eks-svc] terraform: module.role_efs_csi.aws_iam_policy.efs_csi[0]: Refreshing state... [id=arn:aws:iam::079058212236:policy/AmazonEKS_EFS_CSI_Policy-20250720200744614000000001]
10:46:55.956 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...
10:46:55.969 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 0s [id=1541424006]
10:46:55.978 STDOUT [eks-svc] terraform: module.role_alb_controller.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::079058212236:policy/AmazonEKS_AWS_Load_Balancer_Controller-20250720170328253800000002]
10:46:56.075 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:46:56.079 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_iam_policy_document.this[0]: Reading...
10:46:56.081 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2072786136]
10:46:56.083 STDOUT [eks-svc] terraform: module.role_efs_csi.aws_iam_role.this[0]: Refreshing state... [id=tempest-dev-efs-csi20250720200744614600000002]
10:46:56.220 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:46:56.224 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_iam_policy_document.this[0]: Reading...
10:46:56.226 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2641726104]
10:46:56.229 STDOUT [eks-svc] terraform: module.role_alb_controller.aws_iam_role.this[0]: Refreshing state... [id=tempest-dev-alb-controller20250720170328253100000001]
10:46:56.517 STDOUT [eks-svc] terraform: data.aws_eks_cluster.this: Read complete after 1s [id=tempest-dev]
10:46:56.662 STDOUT [eks-svc] terraform: module.role_efs_csi.aws_iam_role_policy_attachment.efs_csi[0]: Refreshing state... [id=tempest-dev-efs-csi20250720200744614600000002/arn:aws:iam::079058212236:policy/AmazonEKS_EFS_CSI_Policy-20250720200744614000000001]
10:46:56.666 STDOUT [eks-svc] terraform: module.role_alb_controller.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=tempest-dev-alb-controller20250720170328253100000001/arn:aws:iam::079058212236:policy/AmazonEKS_AWS_Load_Balancer_Controller-20250720170328253800000002]
10:46:56.670 STDOUT [eks-svc] terraform: kubernetes_service_account.alb_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
10:46:56.680 STDOUT [eks-svc] terraform: module.efs.aws_efs_backup_policy.this[0]: Refreshing state... [id=fs-0658cd6d467b1a715]
10:46:56.680 STDOUT [eks-svc] terraform: kubernetes_storage_class.efs: Refreshing state... [id=efs]
10:46:56.683 STDOUT [eks-svc] terraform: module.efs.data.aws_iam_policy_document.policy[0]: Reading...
10:46:56.685 STDOUT [eks-svc] terraform: module.efs.data.aws_iam_policy_document.policy[0]: Read complete after 0s [id=406307626]
10:46:56.686 STDOUT [eks-svc] terraform: module.efs.aws_efs_file_system_policy.this[0]: Refreshing state... [id=fs-0658cd6d467b1a715]
10:46:57.407 STDOUT [eks-svc] terraform: Planning failed. Terraform encountered an error while generating this plan.
10:46:57.407 STDOUT [eks-svc] terraform: 
10:46:57.408 STDOUT [eks-svc] terraform: ╷
10:46:57.408 STDOUT [eks-svc] terraform: │ Warning: Deprecated attribute
10:46:57.408 STDOUT [eks-svc] terraform: │ 
10:46:57.408 STDOUT [eks-svc] terraform: │   on .terraform/modules/role_alb_controller/modules/iam-role-for-service-accounts-eks/main.tf line 9, in locals:
10:46:57.408 STDOUT [eks-svc] terraform: │    9:   region              = data.aws_region.current.name
10:46:57.409 STDOUT [eks-svc] terraform: │ 
10:46:57.409 STDOUT [eks-svc] terraform: │ The attribute "name" is deprecated. Refer to the provider documentation for
10:46:57.409 STDOUT [eks-svc] terraform: │ details.
10:46:57.409 STDOUT [eks-svc] terraform: │ 
10:46:57.409 STDOUT [eks-svc] terraform: │ (and 3 more similar warnings elsewhere)
10:46:57.409 STDOUT [eks-svc] terraform: ╵
10:46:57.409 STDERR [eks-svc] terraform: ╷
10:46:57.409 STDERR [eks-svc] terraform: │ Error: Unauthorized
10:46:57.409 STDERR [eks-svc] terraform: │ 
10:46:57.409 STDERR [eks-svc] terraform: │   with kubernetes_service_account.alb_controller,
10:46:57.409 STDERR [eks-svc] terraform: │   on alb-controller.tf line 19, in resource "kubernetes_service_account" "alb_controller":
10:46:57.409 STDERR [eks-svc] terraform: │   19: resource "kubernetes_service_account" "alb_controller" {
10:46:57.409 STDERR [eks-svc] terraform: │ 
10:46:57.409 STDERR [eks-svc] terraform: ╵
10:46:57.411 STDERR [eks-svc] terraform: ╷
10:46:57.411 STDERR [eks-svc] terraform: │ Error: Unauthorized
10:46:57.411 STDERR [eks-svc] terraform: │ 
10:46:57.411 STDERR [eks-svc] terraform: │   with kubernetes_storage_class.efs,
10:46:57.412 STDERR [eks-svc] terraform: │   on efs.tf line 76, in resource "kubernetes_storage_class" "efs":
10:46:57.412 STDERR [eks-svc] terraform: │   76: resource "kubernetes_storage_class" "efs" {
10:46:57.412 STDERR [eks-svc] terraform: │ 
10:46:57.412 STDERR [eks-svc] terraform: ╵
10:46:57.425 ERROR  [eks-svc] terraform invocation failed in ./eks-svc/.terragrunt-cache/6Z9yiVJ5Yr-RDY3qcKGmfik7Ly4/qaaRPvfiPI16331-BMfS12cFW_E
10:46:57.425 ERROR  [eks-svc] Module ./eks-svc has finished with an error
10:46:57.772 STDOUT [wordpress-blog] terraform: random_password.db_password: Refreshing state... [id=none]
10:46:58.426 STDOUT [wordpress-blog] terraform: module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
10:46:58.427 STDOUT [wordpress-blog] terraform: data.aws_eks_cluster_auth.this: Reading...
10:46:58.427 STDOUT [wordpress-blog] terraform: module.database.data.aws_partition.current: Reading...
10:46:58.427 STDOUT [wordpress-blog] terraform: data.aws_eks_cluster.this: Reading...
10:46:58.427 STDOUT [wordpress-blog] terraform: module.database.aws_security_group.this[0]: Refreshing state... [id=sg-010eacf33e3ff3d31]
10:46:58.428 STDOUT [wordpress-blog] terraform: data.aws_eks_cluster_auth.this: Read complete after 0s [id=tempest-dev]
10:46:58.428 STDOUT [wordpress-blog] terraform: module.database.data.aws_partition.current: Read complete after 0s [id=aws]
10:46:58.428 STDOUT [wordpress-blog] terraform: module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
10:46:58.430 STDOUT [wordpress-blog] terraform: module.database.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20250720171521636600000001]
10:46:58.997 STDOUT [wordpress-blog] terraform: data.aws_eks_cluster.this: Read complete after 1s [id=tempest-dev]
10:46:59.101 STDOUT [wordpress-blog] terraform: module.database.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20250720171521636600000001/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
10:46:59.102 STDOUT [wordpress-blog] terraform: kubernetes_namespace.wordpress: Refreshing state... [id=tempest-dev-blog]
10:46:59.111 STDOUT [wordpress-blog] terraform: module.database.aws_security_group_rule.this["vpc_ingress"]: Refreshing state... [id=sgrule-241904522]
10:46:59.114 STDOUT [wordpress-blog] terraform: module.database.aws_rds_cluster.this[0]: Refreshing state... [id=tempest-dev-blog]
10:46:59.929 STDOUT [wordpress-blog] terraform: module.database.aws_rds_cluster_instance.this["two"]: Refreshing state... [id=tempest-dev-blog-two]
10:46:59.929 STDOUT [wordpress-blog] terraform: module.database.aws_rds_cluster_instance.this["one"]: Refreshing state... [id=tempest-dev-blog-one]
10:47:00.772 STDOUT [wordpress-blog] terraform: Planning failed. Terraform encountered an error while generating this plan.
10:47:00.772 STDOUT [wordpress-blog] terraform: 
10:47:00.773 STDERR [wordpress-blog] terraform: ╷
10:47:00.773 STDERR [wordpress-blog] terraform: │ Error: Unauthorized
10:47:00.773 STDERR [wordpress-blog] terraform: │ 
10:47:00.773 STDERR [wordpress-blog] terraform: │   with kubernetes_namespace.wordpress,
10:47:00.773 STDERR [wordpress-blog] terraform: │   on application.tf line 23, in resource "kubernetes_namespace" "wordpress":
10:47:00.773 STDERR [wordpress-blog] terraform: │   23: resource "kubernetes_namespace" "wordpress" {
10:47:00.774 STDERR [wordpress-blog] terraform: │ 
10:47:00.774 STDERR [wordpress-blog] terraform: ╵
10:47:00.783 ERROR  [wordpress-blog] terraform invocation failed in ./wordpress-blog/.terragrunt-cache/Oq-7VfxVMau8zfRpjyKOgqDak3s/b6RP9HtdDbccBeMcGhySDrWv4aQ
10:47:00.783 ERROR  [wordpress-blog] Module ./wordpress-blog has finished with an error
10:47:00.783 ERROR  2 errors occurred:

* Failed to execute "terraform plan -input=false -lock=false" in ./eks-svc/.terragrunt-cache/6Z9yiVJ5Yr-RDY3qcKGmfik7Ly4/qaaRPvfiPI16331-BMfS12cFW_E
  ╷
  │ Error: Unauthorized
  │ 
  │   with kubernetes_service_account.alb_controller,
  │   on alb-controller.tf line 19, in resource "kubernetes_service_account" "alb_controller":
  │   19: resource "kubernetes_service_account" "alb_controller" {
  │ 
  ╵
  ╷
  │ Error: Unauthorized
  │ 
  │   with kubernetes_storage_class.efs,
  │   on efs.tf line 76, in resource "kubernetes_storage_class" "efs":
  │   76: resource "kubernetes_storage_class" "efs" {
  │ 
  ╵
  
  exit status 1

* Failed to execute "terraform plan -input=false -lock=false" in ./wordpress-blog/.terragrunt-cache/Oq-7VfxVMau8zfRpjyKOgqDak3s/b6RP9HtdDbccBeMcGhySDrWv4aQ
  ╷
  │ Error: Unauthorized
  │ 
  │   with kubernetes_namespace.wordpress,
  │   on application.tf line 23, in resource "kubernetes_namespace" "wordpress":
  │   23: resource "kubernetes_namespace" "wordpress" {
  │ 
  ╵
  
  exit status 1
```

</details>
    
